#include <stdio.h>
#include <stdlib.h>
#include <conio.h> //Δεν χτυπάει σφάλμα αλλά χρειάζεται για την εντολή getch που πρόσθεσα στο τέλος προκειμένου να παγώνει η το πρόγραμμα και να περιμένει για enter ώστε να τερματήσει το πρόγραμμα

#define N 9

int main()
{
   //Δήλωση μεταβλητών
   char input[N+3];
   int len,i, psifia = 0, valid;     
   long int x, sum = 0, temp, yp, p;
   

   //Πρώτη λούπα που παίρνει την είσοδο από τον χρήστη
   do {
         printf("Dwste enan akeraio (mexri %d psifia):", N);   
         fgets(input , sizeof input, stdin);
         input[strlen(input)-1]='\0';
         fflush(stdin);  
         len = strlen(input);
         valid = 1;

            //Δεύτερη λούπα που ελέγχει αν τα ψηφία είναι νούμερα μικρότερα από 0 ή μεγαλύτερα από 9
         for (i=0;i<len;i++)
            if (input[i]<'0' || input[i]>'9')
               valid=0;

            
         if (!valid)
               //Αν η μεταβλητή valid γίνει 0 από πριν τότε δεν έχουμε έγκυρους χαρακτήρες εισόδου δηλαδή γράμματα ή νούμερα μικρότερα από 0 ή μεγαλύτερα από 9
               printf("Mh egkyroi xaraktires eisodou!\n");        
         else if (len>N)
               //Έλεγχος για τον αν η είσοδος είναι μεγαλύτερη από 9 νούμερα 
            printf("Megali eisodos!\n");
         else if ( (x = atol(input)) == 0)  
               //Έλεγχος για τον αν η είσοδος είναι μεγαλύτερη μηδενική
            printf("Keni i mideniki eisodos!\n");
         else   
            break;  //Αν δεν ισχύει τίποτα απο τα παραπάνω τότε έχουμε έγχυρη είσοδο και προχοράμε στον έλεγχο του αρηθμού για το να ελέγξουμε αν είναι νάρκισος ή όχι
   } while(1);


   //λούπα που μετράει το πόσα ψηφία έχουμε ως είσοδο
   temp = x;   
   while (temp != 0) {
      psifia++;
      temp = temp/10;
   }
   
   //Η βασική λειτουργία του κώδικα που μετράει και διαβάζει ένα ένα τα ψηφία και τα ηψώνει στην δύναμη του μήκους της εισόδου
   temp = x; //πρόσθεσα αυτή την δήλωση για να αρχικοποιήσω το temp με το x. Χ είναι το νούμερο εισόδου το οποίο θα χρησιμοποιηθεί μετά για την λειτουργία του ελέγχου
   //Χωρίς αυτό το πρόγραμμα δεν λειτουργεί.
   //Το mod θα κάνει το 153 σε 3 και θα το πάρει μετά για να το υψώσει στην δύναμη
   
   while (temp != 0) {
      yp = temp%10;
      p = 1;
      for (i=1;i<=psifia;i++)
         p = p * yp;

      sum = sum + p;
      temp = temp/10;
   }
 
 //Εδώ κάνουμε μια διόρθωση το = θα γίνει ==
   if (sum == x)  
      printf("O akeraios %d einai Narkissos.\n", x);
   else
      printf("O akeraios %d den einai Narkissos.\n", x);


   getch(); //παγώνω το πρόγραμμα για να περιμένει το enter του χρήστη γα να προλάβουμε να δούμε το αποτέλεσμα των print στις γραμμές 65 ή 68
   return 0;
}

